app/controllers/items_controller.rb

SELECT * FROM `jumps` WHERE (`jumps`.`to_user_id` = 10) ORDER BY created_at desc
---
    def index
        logger.info("in index")
        @user = self.current_user
        @jumps = Jump.find_all_by_to_user_id(@user.id,:order=>"created_at desc")