app/controllers/relationships_controller.rb

SELECT * FROM `jumps` WHERE (`jumps`.`to_user_id` = 10)
---
    def index
        @user = current_user
        @jumps = Jump.find_all_by_to_user_id(@user.id)