app/controllers/sessions_controller.rb

    def create
        self.current_user = User.authenticate(params[:login], params[:password])
        if logged_in?
            if params[:remember_me] == "1"
                current_user.remember_me unless current_user.remember_token?
                cookies[:auth_token] = { :value => self.current_user.remember_token, :expires => self.current_user.remember_token_expires_at }
            end
            #redirect_to show_user_path

            if session[:last_action]
                redirect_to session[:last_action]
            else
                redirect_to show_user_path
                #redirect_to :controller => 'account', :action => 'index'
            end



            flash[:notice] = "Logged in successfully"
        else


            if params[:login]

                @u = User.find_by_login(params[:login])
---
SELECT * FROM `users` WHERE (`users`.`login` = 'hubertz@online.no') AND (users.state = 'active') LIMIT 1