app/controllers/users_controller.rb

    def show

        if (params[:id])
            @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 10) LIMIT 1

    def add
        @user = User.find_by_login(params[:user][:login])
---
SELECT * FROM `users` WHERE (`users`.`login` = 'pelle@bjelle.com') LIMIT 1

    def find_user
        @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 10) LIMIT 1